Revit 2024 API
FabricRoundingManager Methods
The FabricRoundingManager type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from ReinforcementRoundingManager.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetLengthUnitTypeId
 Gets the identifier of the length unit quantifying the reinforcement rounding values.
 (Inherited from ReinforcementRoundingManager.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
FabricRoundingManager Class
Autodesk.Revit.DB.Structure Namespace